In [1]:

import pandas as pd

In [2]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [4]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [5]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [6]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [7]:
inputs.drop(['Sex'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [8]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [9]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [10]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())

In [11]:
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [16]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [17]:
len(X_train)

712

In [18]:
len(X_test)

179

In [20]:
len(inputs)

891

In [21]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [22]:
model.fit(X_train,y_train)

GaussianNB()

In [23]:
model.score(X_test,y_test)

0.8156424581005587

In [24]:
X_test[0:10]

     Pclass        Age     Fare  female  male
699       3  42.000000   7.6500       0     1
545       1  64.000000  26.0000       0     1
808       2  39.000000  13.0000       0     1
280       3  65.000000   7.7500       0     1
376       3  22.000000   7.2500       1     0
803       3   0.420000   8.5167       0     1
91        3  20.000000   7.8542       0     1
216       3  27.000000   7.9250       1     0
468       3  29.699118   7.7250       0     1
501       3  21.000000   7.7500       1     0

In [25]:
y_test[0:10]

699    0
545    0
808    0
280    0
376    1
803    1
91     0
216    1
468    0
501    0
Name: Survived, dtype: int64

In [26]:
model.predict(X_test[0:10])

array([0, 0, 0, 0, 1, 0, 0, 1, 0, 1], dtype=int64)

In [27]:
model.predict_proba(X_test[:10])

array([[0.98871395, 0.01128605],
       [0.83112409, 0.16887591],
       [0.97729016, 0.02270984],
       [0.97462825, 0.02537175],
       [0.08070796, 0.91929204],
       [0.9738786 , 0.0261214 ],
       [0.98783126, 0.01216874],
       [0.08665132, 0.91334868],
       [0.98938106, 0.01061894],
       [0.07939948, 0.92060052]])